backend/load_test.yml
# Artillery (for Backend Testing)
config:
  target: 'http://127.0.0.1:5000'
  phases:
    - duration: 120  # Ramp up phase duration
      arrivalRate: 1  # Users arriving per second at the start
      rampTo: 5  # Gradually increase the load to 5 users per second
      name: "Ramping up the users"
    - duration: 300  # Sustained load phase duration
      arrivalRate: 5  # Sustained rate of new users per second
      name: "Sustained load"
  processor: "./processors.js"  # External file to handle JS functions for data generation
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Full User Interaction Flow"
    flow:
      - function: "generateUniqueEmail"
      - post:
          url: "/register"
          json:
            email: "{{ email }}"
            password: "password"
          capture:
            json: "$.token"
            as: "authToken"
          think: 1
      - post:
          url: "/login"
          json:
            credentials:
              email: "{{ email }}"
              password: "password"
          capture:
            json: "$.token"
            as: "authToken"
          think: 1
      - post:
          url: "/verification"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            statusCode: 200
          think: 1